column_definitions = {
:a1  => [0,2],#場コード
:a2  => [2,2 ],#年
:a3  => [4,1 ],#回
:a4  => [5,1 ],#日
:a5  => [6,2 ],#レース
:a6  => [8,2 ],#馬番
:a7  => [10,8 ],#血統登録
:a8  => [18,36],#馬名
:a9  => [54,5],#IDM
:a10 => [59,5],#騎手指数
:a11 => [64,5],#情報指数
:a12 => [69,5],#予備１
:a13 => [74,5],#予備２
:a14 => [79,5 ],#予備３
:a15 => [84,5],#総合指数
:a16 => [89,1],#脚質
:a17 => [90, 1],#距離適性
:a18 => [91,1],#上昇度
:a19 => [92,3],#ローテーション
:a20 => [95,5],#基準オッズ
:a21 => [100,2],#基準人気順位
:a22 => [102,5],#基準複勝オッズ
:a23 => [107,2],#基準複勝人気順位
:a24 => [109,3],#特定◎
:a25 => [112,3],#特定○
:a26 => [115,3],#特定▲
:a27 => [118,3],#特定△
:a28 => [121,3],#特定×
:a29 => [124,3],#総合◎
:a30 => [127,3],#総合○
:a31 => [130,3],#総合▲
:a32 => [133,3],#総合△
:a33 => [136,3],#総合×
:a34 => [139,5],#人気指数
:a35 => [144,5],#調教指数
:a36 => [149,5],#厩舎指数
:a37 => [154,1],#調教矢印コード
:a38 => [155,1],#厩舎評価コード
:a39 => [156,4],#騎手期待連対率
:a40 => [160,3],#激走指数
:a41 => [163,2],#蹄コード
:a42 => [165,1],#重適性コード
:a43 => [166,2],#クラスコード
:a44 => [168,2],#予備
:a45 => [170,1],#ブリンカー
:a46 => [171,12],#騎手名
:a47 => [183,3],#負担重量
:a48 => [186,1],#見習い区分
:a49 => [187,12],#調教師名
:a50 => [199,4],#調教師所属
:a51 => [203,16],#前走成績１
:a52 => [219,16],#前走成績２
:a53 => [235,16],#前走成績３
:a54 => [251,16],#前走成績４
:a55 => [267,16],#前走成績５
:a56 => [283,8],#前走１レースキー
:a57 => [291,8],#前走２レースキー
:a58 => [299,8],#前走３レースキー
:a59 => [307,8],#前走４レースキー
:a60 => [315,8],#前走５レースキー
:a61 => [323,1],#枠番
:a62 => [324,2],#予備
:a63 => [326,1],#総合印
:a64 => [327,1],#IDM印
:a65 => [328,1],#情報印
:a66 => [329,1],#騎手印
:a67 => [330,1],#厩舎印
:a68 => [331,1],#調教印
:a69 => [332,1],#激走印
:a70 => [333,1],#芝適性コード
:a71 => [334,1],#ダ適性コード
:a72 => [335,5],#騎手コード
:a73 => [340,5],#調教師コード
:a74 => [345,1],#予備
:a75 => [346,6],#獲得賞金
:a76 => [352,5],#収得賞金
:a77 => [357,1],#条件クラス
:a78 => [358,5],#テン指数
:a79 => [363,5],#ペース指数
:a80 => [368,5],#上がり指数
:a81 => [373,5],#位置指数
:a82 => [378,1],#ペース予想
:a83 => [379,2],#道中順位
:a84 => [381,2],#道中差
:a85 => [383,1],#道中内外
:a86 => [384,2],#後３F順位
:a87 => [386,2],#後３F差
:a88 => [388,1],#後３F内外
:a89 => [389,2],#ゴール順位
:a90 => [391,2],#ゴール差
:a91 => [393,1],#ゴール内外
:a92 => [394,1],#展開記号
:a93 => [395,1],#距離適性２
:a94 => [396,3],#枠確定馬体重
:a95 => [399,3],#枠確定馬体重増減
:a96 => [402,1],#取り消し
:a97 => [403,1],#性別
:a98 => [404,40],#馬主
:a99 => [444,2],#馬主会コード
:a100 => [446,2],#馬記号
:a101 => [448,2],#激走順位
:a102 => [450,2],#LS指数順位
:a103 => [452,2],#テン指数順位
:a104 => [454,2],#ペース指数順位
:a105 => [456,2],#上がり指数順位
:a106 => [458,2],#位置指数順位
:a107 => [460,4],#騎手期待単勝率
:a108 => [464,4],#騎手期待３着内率
:a109 => [468,1],#輸送区分
:a110 => [469,8],#走法
:a111 => [477,24],#体型
:a112 => [501,3],#体系総合１
:a113 => [504,3],#体系総合２
:a114 => [507,3],#体系総合３
:a115 => [510,3],#馬特記１
:a116 => [513,3],#馬特記２
:a117 => [516,3],#馬特記３
:a118 => [519,4],#馬スタート指数
:a119 => [523,4],#馬出遅率
:a120 => [527,2],#参考前走
:a121 => [529,5],#参考前走騎手コード
:a122 => [534,3],#万馬券指数
:a123 => [537,1],#万馬券印
:a124 => [538,1],#降級
:a125 => [539,2],#激走タイプ
:a126 => [541,2],#休養理由
:a127 => [543,16],#フラグ
:a128 => [559,2],#入厩何走目
:a129 => [561,8],#入厩年月日
:a130 => [569,3],#入厩何日前
:a131 => [572,50],#放牧先
:a132 => [622,1],#放牧先ランク
:a133 => [623,1],#厩舎ランク
:a134 => [624,398],#予備
:a135 => [1022,2],#改行
}

File.open("./PACI190420/KYI190420.txt", "r", :encoding => "SJIS"
) do |fin|

  File.open("../data/j_kyi/kyi190420.csv", "w") do |fout|

    fin.each_line do |original|
      column_values = column_definitions.map{|column, range|
        "#{original.byteslice(range[0], range[1]).encode("UTF-8")}"
      }
      fout.puts column_values.join(",")
    end
  end
end

# print load data command (TODO: execute by mysql-cli in terminal directly, or fix this program)
column_names = column_definitions.map{|column, range|
  "#{column}"
}
column_names_str = column_names.join(",")
puts "LOAD DATA LOCAL INFILE '../data/j_kyi/kyi190420.csv' INTO TABLE kyis FIELDS TERMINATED BY ',' LINES TERMINATED BY '\\n' (#{column_names_str});"
