column_definitions = {
  :a   => [ 3, 6 ],#賞金クラス
  :b   => [ 3, 5 ],#収得賞金
  :c   => [ 3, 1 ],#条件クラス
  :d   => [ 3, 5 ],#テン指数
  :e   => [ 3, 5 ],#ペース指数
  :f   => [ 3, 5 ],#上がり指数
  :g   => [ 3, 5 ],#位置指数
  :h   => [ 3, 1 ],#ペース予想
  :i   => [ 3, 2 ],#道中順位
  :j  => [ 3, 2 ],#道中差
  :k  => [ 3, 1 ],#道中内外
  :l  => [ 3, 2 ],#後３F順位
  :m  => [ 3, 2 ],#後３F差
  :n  => [ 3, 1 ],#後３F内外
  :o  => [ 3, 2 ],#ゴール順位
  :p  => [ 3, 2 ],#ゴール差
  :q  => [ 3, 1 ],#ゴール内外
  :r  => [ 3, 1 ],#展開記号

  :s  => [ 3, 1 ],#距離適正
  :t  => [ 3, 3 ],#枠確定馬体重
  :u  => [ 3, 3 ],#枠確定馬体上下
  :v  => [ 3, 1 ],#取り消し
  :w  => [ 3, 1 ],#性別
  :x  => [ 3, 3 ],#馬主
  :y  => [ 3, 2 ],#馬主会
  :z  => [ 3, 2 ],#馬記号
  :q1  => [ 3, 2 ],#激走順位
  :q2  => [ 3, 2 ],#LS指数順位
  :q3  => [ 3, 2 ],#テン指数順位
  :q4  => [ 3, 2 ],#ペース指数順位
  :q5  => [ 3, 2 ],#上がり指数順位
  :q6  => [ 3, 2 ],#位置指数順位

  :q33  => [ 3, 4 ],#騎手期待単勝率
  :q34  => [ 3, 4 ],#騎手３着内率
  :q35  => [ 3, 1 ],#輸送区分

  :q36  => [ 3, 8 ],#走法
  :q37  => [ 3, 3 ],#体型
  :q38  => [ 3, 3 ],#体型１
  :q39  => [ 3, 3 ],#体型２
  :q40  => [ 3, 3 ],#体型３
  :q41  => [ 3, 3 ],#馬特記１
  :q42  => [ 3, 3 ],#馬特記２
  :q43  => [ 3, 3 ],#馬特記３
  :q44  => [ 3, 4 ],#スタート指数
  :q45  => [ 3, 4 ],#出遅れ指数
  :q46  => [ 3, 2 ],#参考前走
  :q47  => [ 3, 5 ],#参考前走騎手
  :q48  => [ 3, 3 ],#万馬券指数
  :q49  => [ 3, 1 ],#万馬券印

  :q50  => [ 3, 1 ],#降級
  :q51  => [ 3, 2 ],#激走
  :q52  => [ 3, 2 ],#休養
  :q53  => [ 3, 3 ],#フラグ
  :q54  => [ 3, 2 ],#入厩何走目
  :q55  => [ 3, 8 ],#入厩年月日
  :q56  => [ 3, 3 ],#入厩何日前
  :q57  => [ 3, 3 ],#放牧先
  :q58  => [ 3, 1 ],#放牧先ランク
  :q59  => [ 3, 1 ],#厩舎ランク

  :q60  => [ 3, 3 ],#予備
  :q61  => [ 3, 2 ],#改行





}
File.open("./PACI190310/OT190310.txt", "r", encoding: 'utf-8'
) do |fin|

  File.open("../data/j_ot/ot190310.csv", "w") do |fout|

    fin.each_line do |original|
      column_values = column_definitions.map{|column, range|
        "#{original.byteslice(range[0], range[1]).encode("UTF-8")}"
      }
      fout.puts column_values.join(",")
    end
  end
end
