column_definitions = {
  :1   => [ 0, 5 ],#騎手コード
  :2   => [ 5, 1 ],#登録抹消
  :3   => [ 6, 8 ],#登録抹消年月日
  :4   => [ 14, 12 ],#騎手名
  :5   => [ 26, 30 ],#騎手カナ
  :6   => [ 56, 6 ],#騎手名略
  :7   => [ 62, 1 ],#所属コード
  :8   => [ 63, 4 ],#所属地名
  :9   => [ 67, 8 ],#生年月日
  :10  => [ 75, 4 ],#初免許年
  :11  => [ 79, 1 ],#見習い区分
  :12  => [ 80, 5 ],#所属厩舎
  :13  => [ 85, 40 ],#騎手コメント
  :14  => [ 125, 8 ],#コメント年月日
  :15  => [ 133, 3 ],#今年リーディング
  :16  => [ 136, 12 ],#今年平地成績
  :17  => [ 148, 12 ],#今年障害成績
  :18  => [ 160, 3 ],#今年特別勝利
  :19  => [ 163, 3 ],#今年重賞勝利
  :20  => [ 166, 3 ],#去年リーディング
  :21  => [ 169, 12 ],#去年平地成績
  :22  => [ 181, 12 ],#去年障害成績
  :23  => [ 193, 3 ],#去年特別成績
  :24  => [ 196, 3 ],#去年重賞成績
  :25  => [ 199, 20 ],#通算平地成績
  :26  => [ 219, 20 ],#通算障害成績
  :27  => [ 239, 8 ],#データ年月日
  :28  => [ 247, 23 ],#予備
  :29  => [ 270, 2 ],#改行






}
File.open("KZA190324.txt", "r", encoding: 'utf-8'
) do |fin|

  File.open("kza190324.csv", "w") do |fout|

    fin.each_line do |original|
      column_values = column_definitions.map{|column, range|
        "#{original.byteslice(range[0], range[1]).encode("UTF-8")}"
      }
      fout.puts column_values.join(",")
    end
  end
end
